import java.util.Scanner;

public class Menu {

    private final Scanner scanner;

    public Menu(Scanner scanner) {
        this.scanner = scanner;
    }

    public String selectFunction() {
        System.out.print( "--------------------------------------\n"
                +"Выберите действие:\n"
                + "--------------------------------------\n"
                + "1. показать все задачи\n"
                + "2. найти задачу по теме\n"
                + "3. найти задачу по автору\n"
                + "4. найти задачи по приоритету\n"
                + "5. выполнить запись планера в файл\n"
                + "6. добавить новую задачу\n"
                + "7. изменить существующую задачу\n"
                + "--------------------------------------\n"
                + "0. Выход\n");
        return scanner.nextLine();
    }

    public String selectSaveType(){
        System.out.print("Выберите тип файла для записи:\n"
                + "1. CSV\n"
                + "2. JSOM\n"
                + "3. XML\n"
                + "--------------------------------------\n"
                + "4. Вернуться в меню\n"
                + "--------------------------------------\n"
                + "0. Выход\n");
        return scanner.nextLine();

    }

    public String selectTaskMeth(){
        System.out.print("Что вы хотите изменить в задаче:\n"
                + "1. Тему\n"
                + "2. Имя автора\n"
                + "3. Приоритет\n"
                + "4. Дедлайн\n"
                + "--------------------------------------\n"
                + "5. Вернуться в меню\n"
                + "--------------------------------------\n"
                + "0. Выход\n");
        return scanner.nextLine();
    }
    public String selectSearchType(){
        System.out.print("Вы будете искать задачу по:\n"
                + "1. ID\n"
                + "2. Теме\n"
                + "--------------------------------------\n"
                + "3. Вернуться в меню\n"
                + "--------------------------------------\n"
                + "0. Выход\n");
        return scanner.nextLine();

    }
}